W7D3/Musicapp/app/controllers/bands_controller.rb

  def destroy
    @band = Band.find_by(id: params[:id])
    @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]

  def update
    @band = Band.find_by(id: params[:id])
    if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Bad Bunnies"], ["updated_at", "2022-06-02 00:18:35.143235"], ["id", 1]]