W7D3/Musicapp/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-06-02 05:34:09.922991"], ["session_token", "W2O4I_eMzVtIBDL3usAxPg"], ["id", 5]]